def cria_baralho():
    baralho = ['A♥️', 'K♥️', 'Q♥️', 'J♥️', '10♥️', '9♥️', '8♥️', '7♥️', '6♥️', '5♥️', '4♥️','3♥️', '2♥️','A♠️', 'K♠️', 'Q♠️', 'J♠️', '10♠️','9♠️', '8♠️', '7♠️', '6♠️', '5♠️', '4♠️', '3♠️', '2♠️','A♦️','K♦️','Q♦️', 'J♦️', '10♦️', '9♦️', '8♦️', '7♦️', '6♦️', '5♦️', '4♦️', '3♦️', '2♦️', 'A♣️', 'K♣️', 'Q♣️', 'J♣️', '10♣️', '9♣️', '8♣️', '7♣️', '6♣️', '5♣️', '4♣️', '3♣️', '2♣️']
    return baralho

def extrai_naipe(carta):
    baralho = ['A♥️', 'K♥️', 'Q♥️', 'J♥️', '10♥️', '9♥️', '8♥️', '7♥️', '6♥️', '5♥️', '4♥️','3♥️', '2♥️','A♠️', 'K♠️', 'Q♠️', 'J♠️', '10♠️','9♠️', '8♠️', '7♠️', '6♠️', '5♠️', '4♠️', '3♠️', '2♠️','A♦️','K♦️','Q♦️', 'J♦️', '10♦️', '9♦️', '8♦️', '7♦️', '6♦️', '5♦️', '4♦️', '3♦️', '2♦️', 'A♣️', 'K♣️', 'Q♣️', 'J♣️', '10♣️', '9♣️', '8♣️', '7♣️', '6♣️', '5♣️', '4♣️', '3♣️', '2♣️']
    if carta[0] + carta[1] == '10': #ou carta[:,2]
            return carta[2]
    return carta[1]

def extrai_valor(carta):
    if carta[0] + carta[1] == '10':
        return '10'
    return carta[0]
    
    